# 16/09/2026
# Matsenko Artemii
# task13

# В восточном календаре принят 60-летний цикл, состоящий из 12- летних подциклов,
# обозначаемых названиями цвета: зеленый, красный, желтый, белый и черный.
# В каждом подцикле годы носят названия животных: крысы, коровы, тигра, зайца, дракона,
# змеи, лошади, овцы, обезьяны, курицы, собаки и свиньи. По номеру года вывести его название,
# если 1984 год был началом цикла — годом зеленой крысы.

num = int(input("Введите номер года: "))

year = (num - 1984) % 60
cycle = year // 12
color = year % 12

print(year)
print(cycle)
print(color)

anima = [
        "ой крысы", "ой коровы", "ого тигра", "ого зайца",
        "ого дракона", "ого змея", "ой лошади", "ой овцы",
        "ой обезьяны", "ой курицы", "ой собаки", "ой свиньи"
        ]

colors = ["Год зелён", "Год зелён", "Год красн", "Год красн", "Год жёлт", "Год жёлт",
          "Год бел", "Год бел", "Год чёрн", "Год чёрн"]

print(colors[cycle], anima[color], sep="")