# 16/09/2026
# Matsenko Artemii
# task10

# todo: 10.1 Дано целое число A. Проверить истинность высказывания: «Число A является четным».
# todo: 10.2 Дано целое число A. Проверить истинность высказывания: «Число A является нечетным».
# Примечание: В задании  требуется вывести логическое значение True, если выражение
# для введеных исходных данных является истинным, и значение False в противном случае.

print("Является ли число А четным?")
A = int(input("Введите целое число: "))
x = A % 2 == 0
print(x)

print("Является ли число А нечетным?")
A = int(input("Введите целое число: "))
x = A % 2 == 1
print(x)