# 11/10/2026
# Matsenko Artemii
# task24

# todo: Шифр Цезаря
# Описание шифра.
# В криптографии шифр Цезаря, также известный шифр сдвига, код Цезаря или сдвиг Цезаря,
# является одним из самых простых и широко известных методов шифрования.
# Это тип подстановочного шифра, в котором каждая буква в открытом тексте заменяется буквой на некоторое
# фиксированное количество позиций вниз по алфавиту. Например, со сдвигом влево 3, D будет заменен на A,
# E станет Б, и так далее. Метод назван в честь Юлия Цезаря, который использовал его в своей частной переписке.
#
# Задача.
# Считайте файл message.txt и зашифруйте  текст шифром Цезаря, при этом символы первой строки файла должны
# циклически сдвигаться влево на 1, второй строки — на 2, третьей строки — на три и т.д.
# В этой задаче удобно считывать файл построчно, шифруя каждую строку в отдельности.
# В каждой строчке содержатся различные символы. Шифровать нужно только буквы кириллицы.

""" Сначала запишу исходный текст в файл message.txt, затем зашифрую """
text = """Описание шифра.
В криптографии шифр Цезаря, также известный шифр сдвига, код Цезаря или сдвиг Цезаря,
является одним из самых простых и широко известных методов шифрования.
Это тип подстановочного шифра, в котором каждая буква в открытом тексте заменяется буквой на некоторое
фиксированное количество позиций вниз по алфавиту. Например, со сдвигом влево 3, D будет заменен на A,
E станет Б, и так далее. Метод назван в честь Юлия Цезаря, который использовал его в своей частной переписке."""

with open("message.txt", "w", encoding="utf-8") as file:
    file.write(text)

lower = 'абвгдеёжзийклмнопрстуфхцчшщъыьэюя'
upper = lower.upper()

with open('message.txt', 'r', encoding='utf-8') as file:
    for i, line in enumerate(file, 1):

        result = ''

        for char in line:
            if char in lower:
                result += lower[(lower.index(char) - i) % 33]
            elif char in upper:
                result += upper[(upper.index(char) - i) % 33]
            else:
                result += char

        print(result, end='')