# 14/09/2026
# Matsenko Artemii
# task12

# todo: Единицы массы пронумерованы следующим образом: 1 — килограмм, 2 — миллиграмм, 3 — грамм,
#  4 — тонна, 5 — центнер. Дан номер единицы массы и масса тела M в этих единицах (вещественное число).
#  Вывести массу данного тела в килограммах

ind = int(input("Введите единицы массы: 1 — килограмм, 2 — миллиграмм, 3 — грамм,"
                "\n4 — тонна, 5 — центнер: "))
mass = float(input("Введите массу тела в выбранных единицах: "))

ind_mass = ["килограмм", "миллиграмм", "грамм", "тонна", "центнер"]

print(f"Масса тела равна {mass} {ind_mass[ind-1]}")